#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../theme.css">

#+NAME: add-bars
#+BEGIN_SRC emacs-lisp :exports none :results output
  (load-file "../bars.el")
#+END_SRC
#+CALL: add-bars()

#+TITLE: Convert data into WinBUGS format

Suppose you have a data table such as 

#+NAME: winbugs
| ID | t |   y |   se |
|----+---+-----+------|
| S1 | 1 | 0.1 | 0.01 |
| S1 | 2 | 0.1 | 0.01 |
| S2 | 1 | 0.1 | 0.01 |
| S2 | 3 | 0.1 | 0.01 |

Where ~ID~ is the study ID, ~t~ is the treatment group, ~y~ is a continuous outcome, and ~se~ is the standard error of ~y~.
This code will convert that data for use with WinBUGS.

#+BEGIN_SRC R :exports both :var data=winbugs :colnames yes
  library(dplyr)
  library(tidyr)

  count_streak <- function(col) {
    sequence(rle(as.character(col))$lengths)
  }

  data %>%
    arrange(ID, t) %>%
    mutate(num = count_streak(ID)) %>%
    gather(Var, Val, t:se) %>%
    mutate(num = paste0("[,", num, "]")) %>%
    unite(VarT, Var, num, sep="") %>%
    spread(VarT, Val)
#+END_SRC

#+RESULTS:
| ID | se[,1] | se[,2] | t[,1] | t[,2] | y[,1] | y[,2] |
|----+--------+--------+-------+-------+-------+-------|
| S1 |   0.01 |   0.01 |     1 |     2 |   0.1 |   0.1 |
| S2 |   0.01 |   0.01 |     1 |     3 |   0.1 |   0.1 |

The idea is to 
  1. Use ~arrange~ by ~ID~ and ~t~, since the lower group should be first, and then create a "streak" count (~num~) of the ~t~ column to determine the first, second, etc. group.
  2. Use ~gather~ to combine ~t~, ~y~, and ~se~ into a single column (~Val~), with a key column (~Var~)
  3. Use ~mutate~ to convert the streak count (~num~) into the proper format (~[,i]~)
  4. Concatenate ~t~ and ~num~ into a single column (~VarT~)
  5. Use ~spread~ to turn ~VarT~ into the header

You can also do this in base R:

#+BEGIN_SRC R
  df_to_winbugs <- function(df, id="id", t="t") {

    work <- function(unformatted, id, t) {
      n <- nrow(unformatted)
      i <- which(colnames(unformatted) == id)
      names <- rep(colnames(unformatted)[-i], each=n)
      names <- paste0(names, "[,", 1:n, "]")
      names <- c(id, names)

      unformatted <- unformatted[order(unformatted[[id]], unformatted[[t]]), ]
      formatted <- do.call(cbind, lapply(unformatted[, -i], function(i) t(i)))
      formatted <- cbind(unformatted[[id]][1], formatted)
      colnames(formatted) <- names

      formatted
    }

    separate <- lapply(split(df, df[[id]]), function(i) work(i, id, t))
    combined <- Reduce(function(x, y) merge(x, y, all=TRUE), separate)
    combined[is.na(combined)] <- "NA"
    sort_by_regex(combined, c(paste0("^", id, "$"),
                              paste0("^", t, "\\["),
                              "^y\\[", "^se\\[", "^n\\[", "^r\\["))

  }

  sort_by_regex <- function(dat, regex, append=TRUE) {
    elts <- lapply(regex, function(r) dat[, grepl(r, colnames(dat)), drop=FALSE])
    sorted <- do.call(cbind, elts)
    if (append) {
      cbind(sorted,
            dat[, !colnames(dat) %in% colnames(sorted)])
    }
  }
#+END_SRC
